Revit 2027 API
Rebar.IsHookLengthOverrideEnabled Method
 Returns True if the ability to override hook lengths is enabled for this rebar instance, False otherwise.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsHookLengthOverrideEnabled()
Public Function IsHookLengthOverrideEnabled As Boolean
public:
bool IsHookLengthOverrideEnabled()
member IsHookLengthOverrideEnabled : unit -> bool
Return Value
Boolean
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace